ncpeh-simulation-mock/src/test/resources/de/gematik/ncpeh/api/mock/PRPA_IN201305UV02_298.xml

<!--
  ~ Copyright 2024-2025 gematik GmbH
  ~
  ~ Licensed under the Apache License, Version 2.0 (the "License");
  ~ you may not use this file except in compliance with the License.
  ~ You may obtain a copy of the License at
  ~
  ~     http://www.apache.org/licenses/LICENSE-2.0
  ~
  ~ Unless required by applicable law or agreed to in writing, software
  ~ distributed under the License is distributed on an "AS IS" BASIS,
  ~ WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  ~ See the License for the specific language governing permissions and
  ~ limitations under the License.
  ~
  ~ *******
  ~
  ~ For additional notes and disclaimer from gematik and in case of changes by gematik find details in the "Readme" file.
  -->
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <!-- Note: The SOAP messages returned by the mock currently do not include the headers
     required for the individual transactions.-->
  <SOAP-ENV:Body>
    <ns6:PRPA_IN201305UV02 xmlns="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0"
      xmlns:ns6="urn:hl7-org:v3" ITSVersion="XML_1.0">
      <ns6:id root="38deb4a3-bc7c-480f-b4e3-6396e19f9416" extension="452fde50-b69b-4424-b22b-6d651d0e04e3"/>
      <ns6:creationTime value="20230124085038.235+0000"/>
      <ns6:versionCode code="V3PR1"/>
      <ns6:interactionId root="2.16.840.1.113883.1.6" extension="PRPA_IN201305UV02"/>
      <ns6:processingCode code="P"/>
      <ns6:processingModeCode code="T"/>
      <ns6:acceptAckCode code="AL"/>
      <ns6:receiver typeCode="RCV">
        <ns6:device classCode="DEV" determinerCode="INSTANCE">
          <ns6:id root="101"/>
          <ns6:asAgent classCode="AGNT">
            <ns6:representedOrganization classCode="ORG" determinerCode="INSTANCE">
              <ns6:id root="101"/>
            </ns6:representedOrganization>
          </ns6:asAgent>
        </ns6:device>
      </ns6:receiver>
      <ns6:sender typeCode="SND">
        <ns6:device classCode="DEV" determinerCode="INSTANCE">
          <ns6:id root="101"/>
          <ns6:asAgent classCode="AGNT">
            <ns6:representedOrganization classCode="ORG" determinerCode="INSTANCE">
              <ns6:id root="101"/>
            </ns6:representedOrganization>
          </ns6:asAgent>
        </ns6:device>
      </ns6:sender>
      <ns6:controlActProcess classCode="CACT" moodCode="EVN">
        <ns6:code code="PRPA_TE201305UV02" codeSystemName="2.16.840.1.113883.1.6"/>
        <ns6:authorOrPerformer typeCode="AUT">
          <ns6:assignedPerson classCode="ASSIGNED"/>
        </ns6:authorOrPerformer>
        <ns6:queryByParameter>
          <ns6:queryId root="1.263507841149"/>
          <ns6:statusCode code="new"/>
          <ns6:responseModalityCode code="R"/>
          <ns6:responsePriorityCode code="I"/>
          <ns6:matchCriterionList/>
          <ns6:parameterList>
            <ns6:livingSubjectId>
              <ns6:value root="1.2.276.0.76.3.1.580.147" extension="X114428538"/>
              <ns6:semanticsText/>
            </ns6:livingSubjectId>
            <ns6:livingSubjectId>
              <ns6:value root="1.2.276.0.76.4.298" extension="A2C4E6"/>
              <ns6:semanticsText/>
            </ns6:livingSubjectId>
          </ns6:parameterList>
        </ns6:queryByParameter>
      </ns6:controlActProcess>
    </ns6:PRPA_IN201305UV02>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>