templates/xcpd_empty.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Body>
    <PRPA_IN201306UV02 xmlns="urn:hl7-org:v3">
      <controlActProcess classCode="CACT" moodCode="EVN">
      </controlActProcess>
    </PRPA_IN201306UV02>
  </soap:Body>
</soap:Envelope>
